In [1]:
import numpy as np
import pandas as pd
import itertools
import functools

In [2]:
import string

In [3]:
letters=list(string.ascii_lowercase)

In [217]:
df1 =  pd.DataFrame({
    'id':list(range(1,25))
     ,
    'gender':list(np.repeat(['Male','Female'],repeats=12))
    ,
    'grp1':[j for i ,j in zip(range(24),itertools.cycle(['A','B','C']))]
    ,
    'grp2':list(np.repeat(['H','H','L','L'],repeats=3))*2
    #[*np.array(['H','L']).repeat(6)]*2
    ,
    'h':[16,17,16,12,17,16,
         17,18,19,19,20,19
        ,14,13,16,12,17,15
         ,17,18,16,18,16,17
        ]
    ,
    'w':[2.5,3,2.1,1.7,4.3,4.7
        ,5.1,4.8,6.4,6.3,8.5,5.5
        ,7.3,8.2,6.4,7.7,7.6,4.4
         ,6.1,6.7,5.2,6.7,5.4,6.3
        ]
    
})

In [114]:
df1.head(3)

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
2   3   Male    C    H  16  2.1

In [115]:
df1.shape

(24, 6)

In [116]:
df1.gender[1:3]

1    Male
2    Male
Name: gender, dtype: object

In [117]:
df1['gender'][1:3]

1    Male
2    Male
Name: gender, dtype: object

In [118]:
df1[['id','gender']][1:3]

   id gender
1   2   Male
2   3   Male

In [119]:
df1[['gender','id']][0:3]

  gender  id
0   Male   1
1   Male   2
2   Male   3

In [120]:
df1[['gender','id']].shape

(24, 2)

In [121]:
df1[0:3]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
2   3   Male    C    H  16  2.1

In [122]:
df1[0:7:2]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1
4   5   Male    B    H  17  4.3
6   7   Male    A    L  17  5.1

In [123]:
df1[slice(0,7,2)]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1
4   5   Male    B    H  17  4.3
6   7   Male    A    L  17  5.1

In [124]:
x=slice(0,10,2);type(x)

slice

In [125]:
df1[0:2]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0

In [126]:
df1.loc[[0]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5

In [127]:
df1.loc[[0,2]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1

In [128]:
df1.loc[[0,2],['gender','h']]

  gender   h
0   Male  16
2   Male  16

In [129]:
df1.loc[[0,2],['gender','h','id']]

  gender   h  id
0   Male  16   1
2   Male  16   3

In [130]:
df1.loc[[0,2],'id':'grp2']

   id gender grp1 grp2
0   1   Male    A    H
2   3   Male    C    H

In [172]:
df1.loc[df1["id"] < 3, "grp1"]

0    A
1    B
Name: grp1, dtype: object

In [131]:
df1.iloc[[0]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5

In [132]:
df1.iloc[[0,2]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1

In [133]:
df1.iloc[[0,2], 0]

0    1
2    3
Name: id, dtype: int64

In [134]:
df1.iloc[[0,2], [0,3]]

   id grp2
0   1    H
2   3    H

In [135]:
df1.iloc[[0,2,5], [0,3,1]]

   id grp2 gender
0   1    H   Male
2   3    H   Male
5   6    H   Male

In [176]:
df1.iloc[0:3, 2:4]

  grp1 grp2
0    A    H
1    B    H
2    C    H

In [136]:
df1.at[0,'id']

1

In [137]:
df1.at[1,'gender']

'Male'

In [138]:
df1.iat[0,0]

1

In [139]:
df1.iat[1,1]

'Male'

In [140]:
df1.dtypes

id          int64
gender     object
grp1       object
grp2       object
h           int64
w         float64
dtype: object

In [141]:
df1.columns

Index(['id', 'gender', 'grp1', 'grp2', 'h', 'w'], dtype='object')

In [150]:
df1[df1['grp1'].isin(['A','B','D'])]

    id  gender grp1 grp2   h    w
0    1    Male    A    H  16  2.5
1    2    Male    B    H  17  3.0
3    4    Male    A    H  12  1.7
4    5    Male    B    H  17  4.3
6    7    Male    A    L  17  5.1
7    8    Male    B    L  18  4.8
9   10    Male    A    L  19  6.3
10  11    Male    B    L  20  8.5
12  13  Female    A    H  14  7.3
13  14  Female    B    H  13  8.2
15  16  Female    A    H  12  7.7
16  17  Female    B    H  17  7.6
18  19  Female    A    L  17  6.1
19  20  Female    B    L  18  6.7
21  22  Female    A    L  18  6.7
22  23  Female    B    L  16  5.4

In [162]:
df1.columns.isin(['id','grp1','grp2'])

array([ True, False,  True,  True, False, False])

In [164]:
df1.columns[df1.columns.isin(['grp1','id'])]

Index(['id', 'grp1'], dtype='object')

In [165]:
df1[df1.columns[df1.columns.isin(['grp1','id'])]]

    id grp1
0    1    A
1    2    B
2    3    C
3    4    A
4    5    B
5    6    C
6    7    A
7    8    B
8    9    C
9   10    A
10  11    B
11  12    C
12  13    A
13  14    B
14  15    C
15  16    A
16  17    B
17  18    C
18  19    A
19  20    B
20  21    C
21  22    A
22  23    B
23  24    C

In [168]:
df1[pd.Index(['grp1','id'])]

   grp1  id
0     A   1
1     B   2
2     C   3
3     A   4
4     B   5
5     C   6
6     A   7
7     B   8
8     C   9
9     A  10
10    B  11
11    C  12
12    A  13
13    B  14
14    C  15
15    A  16
16    B  17
17    C  18
18    A  19
19    B  20
20    C  21
21    A  22
22    B  23
23    C  24

In [169]:
df1[df1["grp1"].notna()]

    id  gender grp1 grp2   h    w
0    1    Male    A    H  16  2.5
1    2    Male    B    H  17  3.0
2    3    Male    C    H  16  2.1
3    4    Male    A    H  12  1.7
4    5    Male    B    H  17  4.3
5    6    Male    C    H  16  4.7
6    7    Male    A    L  17  5.1
7    8    Male    B    L  18  4.8
8    9    Male    C    L  19  6.4
9   10    Male    A    L  19  6.3
10  11    Male    B    L  20  8.5
11  12    Male    C    L  19  5.5
12  13  Female    A    H  14  7.3
13  14  Female    B    H  13  8.2
14  15  Female    C    H  16  6.4
15  16  Female    A    H  12  7.7
16  17  Female    B    H  17  7.6
17  18  Female    C    H  15  4.4
18  19  Female    A    L  17  6.1
19  20  Female    B    L  18  6.7
20  21  Female    C    L  16  5.2
21  22  Female    A    L  18  6.7
22  23  Female    B    L  16  5.4
23  24  Female    C    L  17  6.3

In [171]:
df1[df1["grp1"].notnull()]

    id  gender grp1 grp2   h    w
0    1    Male    A    H  16  2.5
1    2    Male    B    H  17  3.0
2    3    Male    C    H  16  2.1
3    4    Male    A    H  12  1.7
4    5    Male    B    H  17  4.3
5    6    Male    C    H  16  4.7
6    7    Male    A    L  17  5.1
7    8    Male    B    L  18  4.8
8    9    Male    C    L  19  6.4
9   10    Male    A    L  19  6.3
10  11    Male    B    L  20  8.5
11  12    Male    C    L  19  5.5
12  13  Female    A    H  14  7.3
13  14  Female    B    H  13  8.2
14  15  Female    C    H  16  6.4
15  16  Female    A    H  12  7.7
16  17  Female    B    H  17  7.6
17  18  Female    C    H  15  4.4
18  19  Female    A    L  17  6.1
19  20  Female    B    L  18  6.7
20  21  Female    C    L  16  5.2
21  22  Female    A    L  18  6.7
22  23  Female    B    L  16  5.4
23  24  Female    C    L  17  6.3

In [218]:
df1['hw']=df1['h']*df1['w']

In [197]:
df1.head(4)

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6
3   4   Male    A    H  12  1.7  20.4

In [203]:
df1.rename(
    columns={
        "id": "id2",
        "gender": "gen"
    }
).head()

   id2   gen grp1 grp2   h    w    hw
0    1  Male    A    H  16  2.5  40.0
1    2  Male    B    H  17  3.0  51.0
2    3  Male    C    H  16  2.1  33.6
3    4  Male    A    H  12  1.7  20.4
4    5  Male    B    H  17  4.3  73.1

In [204]:
df1.head()

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6
3   4   Male    A    H  12  1.7  20.4
4   5   Male    B    H  17  4.3  73.1

In [205]:
df1[["h", "w"]].median()

h    17.0
w     5.8
dtype: float64

In [206]:
df1.agg(
    {
        "h": ["min", "max", "median", "skew"],
        "w": ["min", "max", "median", "mean"],
    }
)

                h       w
min     12.000000  1.7000
max     20.000000  8.5000
median  17.000000  5.8000
skew    -0.668276     NaN
mean          NaN  5.5375

In [215]:
#df1.groupby("gender").mean() # error
df1.groupby("gender").mean(numeric_only=True)

          id          h      w      hw
gender
Female  18.5  15.750000  6.500  101.70
Male     6.5  17.166667  4.575   81.85

In [209]:
df1[['gender', 'h', 'w','hw']].groupby("gender").mean()

                h      w      hw
gender
Female  15.750000  6.500  101.70
Male    17.166667  4.575   81.85

In [212]:
df1[['gender','grp1', 'h', 'w','hw']].groupby(['gender','grp1']).mean()

                 h      w       hw
gender grp1
Female A     15.25  6.950  104.725
       B     16.00  6.975  110.700
       C     16.00  5.575   89.675
Male   A     16.00  3.900   66.700
       B     18.00  5.150   95.125
       C     17.50  4.675   83.725

In [219]:
df1["gender"].value_counts()

Male      12
Female    12
Name: gender, dtype: int64

In [220]:
df1.count()

id        24
gender    24
grp1      24
grp2      24
h         24
w         24
hw        24
dtype: int64

In [221]:
df1.groupby(['gender']).count()

        id  grp1  grp2   h   w  hw
gender
Female  12    12    12  12  12  12
Male    12    12    12  12  12  12

In [222]:
df1.groupby(['gender','grp1']).count()

             id  grp2  h  w  hw
gender grp1
Female A      4     4  4  4   4
       B      4     4  4  4   4
       C      4     4  4  4   4
Male   A      4     4  4  4   4
       B      4     4  4  4   4
       C      4     4  4  4   4

In [223]:
df1.value_counts()

id  gender  grp1  grp2  h   w    hw
1   Male    A     H     16  2.5  40.0     1
2   Male    B     H     17  3.0  51.0     1
23  Female  B     L     16  5.4  86.4     1
22  Female  A     L     18  6.7  120.6    1
21  Female  C     L     16  5.2  83.2     1
20  Female  B     L     18  6.7  120.6    1
19  Female  A     L     17  6.1  103.7    1
18  Female  C     H     15  4.4  66.0     1
17  Female  B     H     17  7.6  129.2    1
16  Female  A     H     12  7.7  92.4     1
15  Female  C     H     16  6.4  102.4    1
14  Female  B     H     13  8.2  106.6    1
13  Female  A     H     14  7.3  102.2    1
12  Male    C     L     19  5.5  104.5    1
11  Male    B     L     20  8.5  170.0    1
10  Male    A     L     19  6.3  119.7    1
9   Male    C     L     19  6.4  121.6    1
8   Male    B     L     18  4.8  86.4     1
7   Male    A     L     17  5.1  86.7     1
6   Male    C     H     16  4.7  75.2     1
5   Male    B     H     17  4.3  73.1     1
4   Male    A     H     12  1.7  20.4     1
3   Male    C     H     16  2.1  33.6     1
24  Female  C     L     17  6.3  107.1    1
dtype: int64

In [224]:
df1['gender'].value_counts()

Male      12
Female    12
Name: gender, dtype: int64

In [229]:
df1['grp2'].value_counts()

H    12
L    12
Name: grp2, dtype: int64

In [233]:
df1.sort_values(by="hw").head()

    id  gender grp1 grp2   h    w    hw
3    4    Male    A    H  12  1.7  20.4
2    3    Male    C    H  16  2.1  33.6
0    1    Male    A    H  16  2.5  40.0
1    2    Male    B    H  17  3.0  51.0
17  18  Female    C    H  15  4.4  66.0

In [234]:
df1.sort_values(by="hw",ascending=False).head()

    id  gender grp1 grp2   h    w     hw
10  11    Male    B    L  20  8.5  170.0
16  17  Female    B    H  17  7.6  129.2
8    9    Male    C    L  19  6.4  121.6
21  22  Female    A    L  18  6.7  120.6
19  20  Female    B    L  18  6.7  120.6

In [235]:
df1.sort_values(by=['h','hw'],ascending=False).head()

    id  gender grp1 grp2   h    w     hw
10  11    Male    B    L  20  8.5  170.0
8    9    Male    C    L  19  6.4  121.6
9   10    Male    A    L  19  6.3  119.7
11  12    Male    C    L  19  5.5  104.5
19  20  Female    B    L  18  6.7  120.6

In [237]:
df1.sort_values(by=['h','gender'],ascending=False).head()

    id gender grp1 grp2   h    w     hw
10  11   Male    B    L  20  8.5  170.0
8    9   Male    C    L  19  6.4  121.6
9   10   Male    A    L  19  6.3  119.7
11  12   Male    C    L  19  5.5  104.5
7    8   Male    B    L  18  4.8   86.4

In [241]:
no2 = df1[df1["gender"] == "Male"];no2.head()

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6
3   4   Male    A    H  12  1.7  20.4
4   5   Male    B    H  17  4.3  73.1

In [243]:
df1['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [246]:
df1[['gender','grp1']].unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [259]:
distinct1=df1[['gender','grp1']].groupby(['gender','grp1']).count();distinct1

Empty DataFrame
Columns: []
Index: [(Female, A), (Female, B), (Female, C), (Male, A), (Male, B), (Male, C)]

In [263]:
pd.DataFrame(distinct1)

Empty DataFrame
Columns: []
Index: [(Female, A), (Female, B), (Female, C), (Male, A), (Male, B), (Male, C)]

In [264]:
pd.DataFrame(distinct1).reset_index()

   gender grp1
0  Female    A
1  Female    B
2  Female    C
3    Male    A
4    Male    B
5    Male    C

In [279]:
df1.pivot(columns=['gender'],values='h')

AttributeError: 'DataFrameGroupBy' object has no attribute 'pivot'

In [280]:
df1.pivot_table(columns=['gender'],values='h')

gender  Female       Male
h        15.75  17.166667

In [284]:
df1.pivot_table(columns=['gender'],values='h',aggfunc='sum')

gender  Female  Male
h          189   206

In [283]:
df1.pivot_table(columns=['gender'],values='h',aggfunc=lambda x: sum(x))

gender  Female  Male
h          189   206

In [285]:
df1.pivot_table(columns=['gender','grp1'],values='h')

gender Female              Male
grp1        A     B     C     A     B     C
h       15.25  16.0  16.0  16.0  18.0  17.5

In [287]:
df1.pivot_table(index=['gender'],columns=['grp1'],values='h')

grp1        A     B     C
gender
Female  15.25  16.0  16.0
Male    16.00  18.0  17.5

In [289]:
df1.pivot_table(index=['gender','grp2'],columns=['grp1'],values='h',aggfunc=lambda x: min(x))

grp1          A   B   C
gender grp2
Female H     12  13  15
       L     17  16  16
Male   H     12  17  16
       L     17  18  19